yukebrillianth/triagebox_esp32_node/components/triagebox_debug/tb_debug.c
/*
 * Serial debug console: inject frames that would normally come from the STM32,
 * so the whole triage flow can be demoed before the sensor board exists.
 *
 * Build-gated by TB_DEBUG_CONSOLE (see components/triagebox_debug/CMakeLists.txt)
 * -- do not ship it enabled: it lets anyone fake patient vitals over USB.
 *
 * Type `help` in `idf.py monitor` for the command list.
 */
#include "tb_debug.h"

#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include <time.h> /* `rtc`: time()/localtime() for the system-clock line */

#include "bsp/esp32_s3_touch_lcd_4.h"
#include "driver/i2c_master.h"
#include "esp_console.h"
#include "esp_err.h"
#include "esp_heap_caps.h"
#include "esp_log.h"
#include "esp_timer.h"
#include "freertos/FreeRTOS.h"
#include "freertos/task.h"
#include "soc/i2c_struct.h" /* `i2cstate`: a hang-free register peek */

#include "bp_capture.h" /* `bplog`: arm the CSV dump */
#include "tb_i2c_codec.h"
#include "tb_link_i2c.h"
#include "tb_rtc.h" /* `rtc`: read/set the only clock this firmware has */
#include "tb_triage.h"
#include "tb_ui_source.h"
#include "ui_demo.h"
#include "ui_mock.h"
#include "ui_status.h"

static const char *TAG = "tb_debug";

/*
 * Every inject command calls tb_ui_source_mark_frame(), which is right -- an
 * injected frame IS a frame as far as the UI is concerned -- but it also greens
 * the System dot for the full LINK_STALE_MS (45 s) with no STM32 on the bus. The
 * dots are the first thing anyone reads to decide whether the link is alive, so
 * say it out loud each time rather than leaving a demo to be misread as hardware.
 */
#define INJECT_NOTE \
    "  the System dot now reads OK for 45 s; that is this command, not the STM32\n"

static int cmd_rfid(int argc, char **argv)
{
    rfid_t r = {0};
    const char *tag = (argc > 1) ? argv[1] : "3021";

    strncpy(r.tag, tag, RFID_TAG_CAPACITY - 1U);
    r.present = true;
    tb_ui_source_mark_frame();
    tb_ui_source_on_rfid(&r);
    printf("injected RFID '%s'\n" INJECT_NOTE, r.tag);
    return 0;
}

static int cmd_vital(int argc, char **argv)
{
    /* Defaults are a healthy adult; override any prefix of the arguments. */
    vitals_t v = {
        .hr = 90, .spo2 = 98, .rr = 18, .bp_sys = 120, .bp_dia = 80,
        .battery = 80,
        .valid_mask = UI_VITAL_HR | UI_VITAL_SPO2 | UI_VITAL_RR | UI_VITAL_BP,
        .valid = true,
    };

    if (argc > 1) v.hr     = (uint16_t)atoi(argv[1]);
    if (argc > 2) v.spo2   = (uint16_t)atoi(argv[2]);
    if (argc > 3) v.rr     = (uint16_t)atoi(argv[3]);
    if (argc > 4) v.bp_sys = (uint16_t)atoi(argv[4]);
    if (argc > 5) v.bp_dia = (uint16_t)atoi(argv[5]);

    tb_ui_source_mark_frame();
    tb_ui_source_on_vital(&v);
    printf("injected VITAL hr=%u spo2=%u rr=%u bp=%u/%u\n" INJECT_NOTE,
           v.hr, v.spo2, v.rr, v.bp_sys, v.bp_dia);
    return 0;
}

/*
 * `status` must take an explicit mask. With no argument it used to inject
 * UI_SENSOR_ALL unconditionally -- the dot went green for good with no expiry
 * and nothing behind it, and because the injection paths below also call
 * mark_frame(), the System dot followed it. A demo convenience that cannot be
 * turned off is a lie with a timer on it. `status all` is two more characters
 * and honest; the dot then greens for exactly 45 s, which is what a demo of the
 * staleness logic wants to show anyway.
 */
static int cmd_status(int argc, char **argv)
{
    uint8_t mask;
    int lora = (argc > 2) ? ((strcmp(argv[2], "ok") == 0) ? 1 :
                             (strcmp(argv[2], "down") == 0) ? 0 : atoi(argv[2])) : 1;

    if (argc < 2) {
        printf("usage: status <sensor_mask|all|none> [lora 0|1|ok|down]\n");
        printf("  all = ECG+MAX30102+RFID+MIC (UI_SENSOR_ALL, the LoRa bit's own "
               "dot); 'none' greens nothing\n");
        return 1;
    }
    if (strcmp(argv[1], "all") == 0) {
        mask = UI_SENSOR_ALL;
    } else if (strcmp(argv[1], "none") == 0) {
        mask = 0;
    } else {
        char *end;

        long m = strtol(argv[1], &end, 0);
        if (*argv[1] == '\0' || *end != '\0' || m < 0 || m > 0xff) {
            printf("sensor_mask must be 'all', 'none' or 0..0xff\n");
            return 1;
        }
        mask = (uint8_t)m;
    }

    tb_ui_source_mark_frame();
    tb_ui_source_on_status(mask, 80, lora);
    printf("injected STATUS sensors=0x%02x lora=%d\n" INJECT_NOTE, mask, lora);
    return 0;
}

/*
 * Same toggle as the Menu dialog, from the serial console.
 *
 * Two reasons it exists rather than leaving the dialog as the only entry point:
 * a finger reaching for the screen is in shot, and the dialog cannot be driven
 * by `btn 3` alone (its buttons are touch targets), so this is also the only way
 * to exercise the demo path without hands on the panel.
 */
static int cmd_demo(int argc, char **argv)
{
    if (argc > 1) {
        ui_demo_set(atoi(argv[1]) != 0);
    } else {
        ui_demo_toggle();
    }
    printf("demo mode %s -- vitals and triage are %s\n",
           ui_demo_enabled() ? "ON" : "OFF",
           ui_demo_enabled() ? "FAKE (always MERAH)" : "from the sensors");
    return 0;
}

static int cmd_btn(int argc, char **argv)
{
    /* Parsed as a long and range-checked BEFORE any narrowing: (uint8_t)atoi()
     * truncated "btn 256" to 0, so the check never fired and the console pressed
     * Scan instead of refusing. */
    long v = (argc > 1) ? strtol(argv[1], NULL, 0) : 0;
    uint8_t idx;

    if (v < 0 || v > 3) {
        printf("button index must be 0..3\n");
        return 1;
    }
    idx = (uint8_t)v;
    /* Press and release: the keypad indev needs both edges. */
    tb_ui_source_on_button(idx, true);
    vTaskDelay(pdMS_TO_TICKS(120));
    tb_ui_source_on_button(idx, false);
    printf("pressed button %u\n", idx);
    return 0;
}

/*
 * Sweep the shared I2C bus (SDA GPIO15 / SCL GPIO7) and name what answers.
 * The bus is the BSP's -- bsp_i2c_get_handle(), never a second bus -- so this
 * only works after bsp_display_start(), which is why the REPL starts last.
 *
 * Addresses 0x00-0x07 and 0x78-0x7f are reserved by the I2C spec and are not
 * probed: a general-call write can reconfigure every device on the bus at once.
 */
static const char *i2c_known(uint8_t addr)
{
    switch (addr) {
    case 0x14: return "GT911 touch (fallback addr)";
    case 0x1e: return "SW6106 PMIC (if 0x3C in the datasheet is the write byte)";
    case 0x20: return "TCA9554 expander (A2:A0=000)";
    case 0x21: case 0x22: case 0x23:
    case 0x24: case 0x25: case 0x26: case 0x27: return "TCA9554 expander (strapped)";
    case 0x3c: return "SW6106 PMIC (datasheet 9.17: slave address 0x3C)";
    case 0x42: return "STM32F411 link slave (tb_regs.h) -- try `i2clink`";
    case 0x51: return "PCF85063A RTC";
    case 0x5d: return "GT911 touch";
    case 0x6a: case 0x6b: return "QMI8658 IMU -- marked NC on V3.0, so unexpected";
    default:   return "unknown -- something on the Interface header?";
    }
}

static int cmd_i2c(int argc, char **argv)
{
    i2c_master_bus_handle_t bus = bsp_i2c_get_handle();
    /*
     * 50 ms: a device that clock-stretches (the STM32 will) needs more than the
     * 10 ms every example uses, and a scan is not latency-sensitive.
     *
     * Validated before it reaches i2c_master_probe(): a negative timeout arrives
     * at the driver as portMAX_DELAY, and with the task WDT off
     * (CONFIG_ESP_TASK_WDT_INIT=n) `i2c -1` was a permanent, silent hang of the
     * console task on the first address that did not answer. 10 s is the upper
     * bound because 112 addresses times any more is a sweep nobody waits out.
     */
    long t = (argc > 1) ? strtol(argv[1], NULL, 0) : 50;
    const int timeout_ms = (int)t;
    /* Probe once and remember, rather than sweeping twice for the grid and the
     * list -- at 50 ms a miss, a second pass costs seconds. */
    bool present[0x78] = {false};
    int found = 0;

    if (t < 1 || t > 10000) {
        printf("timeout_ms must be 1..10000 -- a negative value reaches the "
               "driver as 'wait forever', and with the task WDT off that is a "
               "permanent hang, not an error\n");
        return 1;
    }
    if (bus == NULL) {
        printf("I2C bus not up -- bsp_i2c_init() has not run\n");
        return 1;
    }

    printf("scanning 0x08..0x77 on SDA=%d SCL=%d (timeout %d ms)\n",
           BSP_I2C_SDA, BSP_I2C_SCL, timeout_ms);
    printf("     0  1  2  3  4  5  6  7  8  9  a  b  c  d  e  f\n");

    for (uint8_t hi = 0x00; hi <= 0x70; hi = (uint8_t)(hi + 0x10)) {
        printf("%02x: ", hi);
        for (uint8_t lo = 0x00; lo <= 0x0f; lo++) {
            uint8_t addr = (uint8_t)(hi | lo);

            if (addr < 0x08U || addr > 0x77U) {
                printf("   ");
                continue;
            }
            /* One take per address, not one per scan: the GT911 is polled on this
             * bus by the LVGL task and the STM32 at 20 Hz, and 112 probes behind
             * a single lock would stall both for seconds. */
            if (!bsp_i2c_lock(100)) {
                printf("\n  bus busy for 100 ms -- something is holding it. Try "
                       "`i2cstate`.\n");
                return 1;
            }
            present[addr] = (i2c_master_probe(bus, addr, timeout_ms) == ESP_OK);
            bsp_i2c_unlock();
            if (present[addr]) {
                printf("%02x ", addr);
                found++;
            } else {
                printf("-- ");
            }
        }
        printf("\n");
    }

    printf("\n%d device(s):\n", found);
    for (uint8_t addr = 0x08U; addr < 0x78U; addr++) {
        if (present[addr]) {
            printf("  0x%02x  %s\n", addr, i2c_known(addr));
        }
    }
    if (found == 0) {
        printf("  nothing answered -- check pull-ups, or SDA stuck low after a\n"
               "  soft reset (AGENTS.md item 20 wants bus recovery for exactly this)\n");
    }
    printf("\n");
    return 0;
}

