yukebrillianth/triagebox_esp32_node/components/triagebox_debug/tb_debug.c
/*
 * Direct, register-level dump of the I2C peripheral. This is the one command
 * that can be typed while the bus is dead and still answer: it reads
 * memory-mapped registers only -- no lock, no transaction -- so it cannot hang
 * and cannot make anything worse. It exists because the usual "is the bus
 * wedged?" sequence (scan, read a device) is exactly what fails when the bus is
 * wedged, in silence, for 26 ms per device.
 *
 * The headline number is scl_sp_conf.scl_rst_slv_en: IDF v6.0.2's S3 clear-bus
 * leaves it set on every transaction error (see tb_link_i2c.c's
 * link_bus_wedged()). When it is 1, every future transaction re-arms recovery
 * that never runs, SCL never moves, and the master times out forever. The
 * `tb_link` task clears it on the next poll -- if that is not happening, the
 * numbers here are the evidence.
 *
 * 0x42 is I2C0; with the standard sdkconfig it is CONFIG_BSP_I2C_NUM=1 (I2C1),
 * because the BSP lives on the S3's second peripheral.
 */
static int cmd_i2cstate(int argc, char **argv)
{
    i2c_dev_t *hw = (BSP_I2C_NUM == 0) ? &I2C0 : &I2C1;

    (void)argc;
    (void)argv;

    printf("I2C%d peripheral register dump (memory-mapped, no bus traffic):\n",
           BSP_I2C_NUM);
    printf("  scl_rst_slv_en    = %u   %s\n",
           hw->scl_sp_conf.scl_rst_slv_en,
           hw->scl_sp_conf.scl_rst_slv_en
               ? "WEDGED -- recovery armed forever; `tb_link` should clear it "
                 "next poll"
               : "(clear)");
    printf("  scl_rst_slv_num   = %u\n", hw->scl_sp_conf.scl_rst_slv_num);
    printf("  bus_busy          = %u   %s\n", hw->sr.bus_busy,
           hw->sr.bus_busy ? "transfer in flight or SDA/SCL held low"
                           : "idle");
    printf("  arb_lost          = %u\n", hw->sr.arb_lost);
    printf("  slave_addressed   = %u\n", hw->sr.slave_addressed);
    printf("  txfifo_cnt        = %u\n", hw->sr.txfifo_cnt);
    printf("  rxfifo_cnt        = %u\n", hw->sr.rxfifo_cnt);
    printf("  scl_main_state    = %u   (0=idle 1=addr 2=ack-addr 3=rx 4=tx "
           "5=ack 6=wait-ack)\n",
           hw->sr.scl_main_state_last);
    printf("  scl_state         = %u   (0=idle 1=start 2=neg-edge 3=low "
           "4=pos-edge 5=high 6=stop)\n",
           hw->sr.scl_state_last);
    printf("  time_out_en       = %u   (master bit timeout -- 0 means every "
           "transfer can wait forever)\n",
           hw->to.time_out_en);
    printf("  time_out_value    = %u\n", hw->to.time_out_value);
    printf("  int_raw.time_out_int_raw    = %u\n", hw->int_raw.time_out_int_raw);
    printf("  int_raw.arb_lost_int_raw    = %u\n", hw->int_raw.arbitration_lost_int_raw);
    printf("  int_raw.trans_complete_int_raw = %u\n", hw->int_raw.trans_complete_int_raw);
    printf("\n"
           "  Reading this costs no bus time, so it is the one command that "
           "works\n"
           "  while the bus is wedged. If scl_rst_slv_en=1, a transaction error\n"
           "  happened and the IDF S3 driver never cleared it; the tb_link poll\n"
           "  task should clear it within one poll (50 ms).\n");
    return 0;
}

/*
 * One locked register read, for the commands whose whole transaction is
 * "write the pointer, read the bytes".
 *
 * Locked because this bus is shared with the GT911 the LVGL task polls, the
 * SW6106 the status bar reads and the STM32 polled at 20 Hz -- and unlocked
 * debug reads are not a tidiness point: `i2cdump 0x3c` is 256 transactions
 * landing in the middle of other people's sequences.
 *
 * One take per transaction rather than per command, and 100 ms rather than a
 * block: a wedged bus must make a command SAY so, not join the queue of tasks
 * waiting on it. That is what `i2cstate` is for.
 */
static esp_err_t locked_reg_read(i2c_master_dev_handle_t dev, uint8_t reg,
                                 uint8_t *buf, size_t count)
{
    esp_err_t err;

    if (!bsp_i2c_lock(100)) {
        return ESP_ERR_TIMEOUT;
    }
    err = i2c_master_transmit_receive(dev, &reg, 1, buf, count, 100);
    bsp_i2c_unlock();
    return err;
}

/*
 * Read registers from one device, to identify whatever `i2c` turned up.
 *
 * Read-only on purpose: there is no `i2cwrite`. A stray write to the SW6106 at
 * 0x3c could latch the power path off mid-triage, and the datasheet publishes no
 * register map to write against.
 *
 * Two transaction shapes, because devices disagree about which they accept:
 *   default -- write pointer, repeated START, read   (the usual convention)
 *   "split" -- write pointer, STOP, separate read    (SW6106 datasheet 9.17 is
 *              drawn as "1st/2nd/3rd step", which hints at this)
 * Note many expanders (TCA9554 included) do not auto-increment the pointer, so
 * count > 1 re-reads the same register rather than walking upward.
 */
static int cmd_i2creg(int argc, char **argv)
{
    i2c_master_bus_handle_t bus = bsp_i2c_get_handle();
    i2c_master_dev_handle_t dev = NULL;
    i2c_device_config_t cfg = {
        .dev_addr_length = I2C_ADDR_BIT_LEN_7,
        .scl_speed_hz = 100000,   /* slowest thing on the bus tolerates it */
    };
    uint8_t reg;
    uint8_t buf[16] = {0};
    int count;
    bool split;
    esp_err_t err;

    if (argc < 3) {
        printf("usage: i2creg <addr> <reg> [count 1..%d] [split]  (values accept 0x)\n",
               (int)sizeof(buf));
        printf("  TCA9554: 0=input 1=output 2=polarity 3=config (0xff = all inputs,\n");
        printf("           i.e. nobody configured it). Pointer does NOT auto-increment,\n");
        printf("           so read one register at a time.\n");
        printf("  SW6106 : `pmic` decodes the ADC block (0x14-0x1B, 0x4F) for you.\n");
        printf("           0xb0 is named in the datasheet; try `split` if a plain\n");
        printf("           read returns 00.\n");
        return 1;
    }
    if (bus == NULL) {
        printf("I2C bus not up -- bsp_i2c_init() has not run\n");
        return 1;
    }

    cfg.device_address = (uint16_t)strtoul(argv[1], NULL, 0);
    reg   = (uint8_t)strtoul(argv[2], NULL, 0);
    /* "split" is accepted in either trailing position, so `i2creg a r split`
     * works without having to pass a count you did not care about. */
    split = false;
    count = 1;
    for (int i = 3; i < argc; i++) {
        if (strcmp(argv[i], "split") == 0) {
            split = true;
        } else {
            count = atoi(argv[i]);
        }
    }

    if (cfg.device_address < 0x08U || cfg.device_address > 0x77U) {
        printf("address must be 0x08..0x77\n");
        return 1;
    }
    if (count < 1 || count > (int)sizeof(buf)) {
        printf("count must be 1..%d\n", (int)sizeof(buf));
        return 1;
    }

    if (i2c_master_bus_add_device(bus, &cfg, &dev) != ESP_OK) {
        printf("could not add device 0x%02x\n", (unsigned)cfg.device_address);
        return 1;
    }
    /* Both transaction shapes behind ONE take: the pointer write and its read
     * are a pair, and a transaction from another task in between re-points the
     * register. Same pattern as `i2clink`. */
    if (!bsp_i2c_lock(100)) {
        printf("I2C bus busy (lock timeout) -- try `i2cstate`\n");
        (void)i2c_master_bus_rm_device(dev);
        return 1;
    }
    if (split) {
        err = i2c_master_transmit(dev, &reg, 1, 100);
        if (err == ESP_OK) {
            err = i2c_master_receive(dev, buf, (size_t)count, 100);
        }
    } else {
        err = i2c_master_transmit_receive(dev, &reg, 1, buf, (size_t)count, 100);
    }
    bsp_i2c_unlock();
    if (err == ESP_OK) {
        printf("0x%02x reg 0x%02x%s:", (unsigned)cfg.device_address, reg,
               split ? " (split)" : "");
        for (int i = 0; i < count; i++) {
            printf(" %02x", buf[i]);
        }
        printf("\n");
    } else {
        printf("read failed: %s\n", esp_err_to_name(err));
        printf("  ACKed the scan but refused this transaction -- try `split`, or\n"
               "  `i2craw 0x%02x` if it has no register pointer at all\n",
               (unsigned)cfg.device_address);
    }
    (void)i2c_master_bus_rm_device(dev);
    return (err == ESP_OK) ? 0 : 1;
}

