yukebrillianth/triagebox_esp32_node/components/triagebox_debug/tb_debug.c
/*
 * Plain read with no pointer write, for a device that NAKs the register byte.
 * Distinguishes "no register-pointer protocol" from "phantom ACK": a phantom
 * from partial address decoding fails here too.
 */
static int cmd_i2craw(int argc, char **argv)
{
    i2c_master_bus_handle_t bus = bsp_i2c_get_handle();
    i2c_master_dev_handle_t dev = NULL;
    i2c_device_config_t cfg = {
        .dev_addr_length = I2C_ADDR_BIT_LEN_7,
        .scl_speed_hz = 100000,
    };
    uint8_t buf[16] = {0};
    int count;
    esp_err_t err;

    if (argc < 2) {
        printf("usage: i2craw <addr> [count 1..%d]\n", (int)sizeof(buf));
        return 1;
    }
    if (bus == NULL) {
        printf("I2C bus not up -- bsp_i2c_init() has not run\n");
        return 1;
    }

    cfg.device_address = (uint16_t)strtoul(argv[1], NULL, 0);
    count = (argc > 2) ? atoi(argv[2]) : 4;

    if (cfg.device_address < 0x08U || cfg.device_address > 0x77U) {
        printf("address must be 0x08..0x77\n");
        return 1;
    }
    if (count < 1 || count > (int)sizeof(buf)) {
        printf("count must be 1..%d\n", (int)sizeof(buf));
        return 1;
    }

    if (i2c_master_bus_add_device(bus, &cfg, &dev) != ESP_OK) {
        printf("could not add device 0x%02x\n", (unsigned)cfg.device_address);
        return 1;
    }
    if (!bsp_i2c_lock(100)) {
        printf("I2C bus busy (lock timeout) -- try `i2cstate`\n");
        (void)i2c_master_bus_rm_device(dev);
        return 1;
    }
    err = i2c_master_receive(dev, buf, (size_t)count, 100);
    bsp_i2c_unlock();
    if (err == ESP_OK) {
        printf("0x%02x raw:", (unsigned)cfg.device_address);
        for (int i = 0; i < count; i++) {
            printf(" %02x", buf[i]);
        }
        printf("\n");
    } else {
        printf("raw read failed: %s\n", esp_err_to_name(err));
        printf("  ACKs its address but yields no data on either transaction shape --\n"
               "  likely a partial-address-decode phantom, or write-only\n");
    }
    (void)i2c_master_bus_rm_device(dev);
    return (err == ESP_OK) ? 0 : 1;
}

/*
 * Sweep one device's register space, read-only, to recover an undocumented map.
 * The SW6106 datasheet names exactly one register (0xb0) and publishes no map,
 * so the only way to find the fuel gauge is to look at which registers hold
 * something other than 00/ff.
 *
 * Reads only. Some devices clear interrupt flags on read, so a dump is not
 * perfectly side-effect free -- but it cannot reconfigure a battery charger,
 * which a blind write absolutely can.
 */
static int cmd_i2cdump(int argc, char **argv)
{
    i2c_master_bus_handle_t bus = bsp_i2c_get_handle();
    i2c_master_dev_handle_t dev = NULL;
    i2c_device_config_t cfg = {
        .dev_addr_length = I2C_ADDR_BIT_LEN_7,
        .scl_speed_hz = 100000,
    };
    unsigned start;
    unsigned end;
    int interesting = 0;

    if (argc < 2) {
        printf("usage: i2cdump <addr> [start] [end]   (default 0x00..0xff)\n");
        printf("  read-only. '--' = NAK, '..' = reads 00, 'ff' shown as-is.\n");
        return 1;
    }
    if (bus == NULL) {
        printf("I2C bus not up -- bsp_i2c_init() has not run\n");
        return 1;
    }

    cfg.device_address = (uint16_t)strtoul(argv[1], NULL, 0);
    start = (argc > 2) ? (unsigned)strtoul(argv[2], NULL, 0) : 0x00U;
    end   = (argc > 3) ? (unsigned)strtoul(argv[3], NULL, 0) : 0xffU;

    if (cfg.device_address < 0x08U || cfg.device_address > 0x77U) {
        printf("address must be 0x08..0x77\n");
        return 1;
    }
    if (start > 0xffU || end > 0xffU || start > end) {
        printf("range must be 0x00..0xff and start <= end\n");
        return 1;
    }
    if (i2c_master_bus_add_device(bus, &cfg, &dev) != ESP_OK) {
        printf("could not add device 0x%02x\n", (unsigned)cfg.device_address);
        return 1;
    }

    printf("dump 0x%02x regs 0x%02x..0x%02x\n",
           (unsigned)cfg.device_address, start, end);
    printf("      0  1  2  3  4  5  6  7  8  9  a  b  c  d  e  f\n");
    for (unsigned base = start & 0xf0U; base <= end; base += 0x10U) {
        printf("%02x:  ", base);
        for (unsigned lo = 0U; lo < 0x10U; lo++) {
            unsigned r = base | lo;
            uint8_t reg = (uint8_t)r;
            uint8_t val = 0U;

            if (r < start || r > end) {
                printf("   ");
                continue;
            }
            /* One take per register, not one per dump: 256 transactions behind a
             * single lock would stall the LVGL touch poll and the STM32 link for
             * the whole sweep. A held bus prints as a NAK column and the sweep
             * carries on -- `i2cstate` is the command that explains it. */
            if (locked_reg_read(dev, reg, &val, 1) != ESP_OK) {
                printf("-- ");
            } else if (val == 0U) {
                printf(".. ");
            } else {
                printf("%02x ", val);
                interesting++;
            }
        }
        printf("\n");
    }
    printf("\n%d register(s) read non-zero\n\n", interesting);
    (void)i2c_master_bus_rm_device(dev);
    return 0;
}

static int cmd_stats(int argc, char **argv)
{
    /* Time inference over many runs: the old SVM was well under esp_timer's
     * resolution, so a single measurement read 0 or 1 us. The GBM pipeline is
     * far heavier -- this is now the number that actually matters. */
    const int iterations = 100;
    vitals_t v = {
        .hr = 112, .spo2 = 93, .rr = 24, .bp_sys = 100, .bp_dia = 65,
        .battery = 80,
        .valid_mask = UI_VITAL_HR | UI_VITAL_SPO2 | UI_VITAL_RR | UI_VITAL_BP,
        .valid = true,
    };
    float conf = 0.0f;
    int esi = 0;
    int64_t t0;
    int64_t elapsed_us;
    /* esp_lvgl_port names it "taskLVGL", not "LVGL". */
    TaskHandle_t lvgl = xTaskGetHandle("taskLVGL");

    (void)argc;
    (void)argv;

    t0 = esp_timer_get_time();
    for (int i = 0; i < iterations; i++) {
        (void)tb_triage_classify(&v, UI_AGE_BAND_18_45, UI_GENDER_M, false,
                                 &conf, &esi);
    }
    elapsed_us = esp_timer_get_time() - t0;

