yukebrillianth/triagebox_esp32_node/components/triagebox_debug/tb_debug.c
    printf("\n--- inference ---\n");
    printf("tb_triage_classify: %.1f us/call (%d calls in %lld us)\n",
           (double)elapsed_us / iterations, iterations, elapsed_us);
    /* Two model runs per call, not one -- see the ponytail note in
     * tb_triage_model.c. The figure above is what the firmware actually pays. */
    printf("called once per patient, so ~%.4f%% of one 60 s measure window\n",
           100.0 * ((double)elapsed_us / iterations) / 60e6);
    printf("result now: priority=%d esi=%d confidence=%.2f\n",
           (int)tb_triage_classify(&v, UI_AGE_BAND_18_45, UI_GENDER_M, false,
                                   &conf, &esi),
           esi, (double)conf);

    printf("\n--- heap ---\n");
    printf("internal free  : %u bytes (min ever %u)\n",
           (unsigned)heap_caps_get_free_size(MALLOC_CAP_INTERNAL),
           (unsigned)heap_caps_get_minimum_free_size(MALLOC_CAP_INTERNAL));
    printf("PSRAM free     : %u bytes (min ever %u)\n",
           (unsigned)heap_caps_get_free_size(MALLOC_CAP_SPIRAM),
           (unsigned)heap_caps_get_minimum_free_size(MALLOC_CAP_SPIRAM));
    printf("largest block  : %u internal / %u PSRAM\n",
           (unsigned)heap_caps_get_largest_free_block(MALLOC_CAP_INTERNAL),
           (unsigned)heap_caps_get_largest_free_block(MALLOC_CAP_SPIRAM));

    printf("\n--- task stacks (bytes still unused; 0 means overflow) ---\n");
    if (lvgl != NULL) {
        /* This is the one that overflowed at the default 7168 during bring-up. */
        printf("taskLVGL : %u of 32768\n",
               (unsigned)(uxTaskGetStackHighWaterMark(lvgl) * sizeof(StackType_t)));
    } else {
        printf("taskLVGL : not found\n");
    }
    /* The link poll task: "tb_i2c" (tb_link_i2c.c), not the "tb_rx" its RS485
     * ancestor had. Looking for the old name meant this line silently never
     * printed -- and this is one of the two tasks whose stack has actually
     * overflowed during bring-up, so it is the line `stats` exists for.
     * 3072 is that file's TB_TASK_STACK, which it does not export. */
    TaskHandle_t rx = xTaskGetHandle("tb_i2c");
    if (rx != NULL) {
        printf("tb_i2c   : %u of 3072\n",
               (unsigned)(uxTaskGetStackHighWaterMark(rx) * sizeof(StackType_t)));
    } else {
        printf("tb_i2c   : not found (link not started?)\n");
    }
    /* Us. Printed because this is the task that ran the model above, and it is
     * the one that overflowed at the 4096 default -- see tb_debug_start(). */
    printf("console  : %u of 16384\n",
           (unsigned)(uxTaskGetStackHighWaterMark(NULL) * sizeof(StackType_t)));

    printf("\n--- link ---\n");
    printf("polls_ok=%u polls_failed=%u btn_dropped=%u\n",
           (unsigned)tb_link_frames_ok(), (unsigned)tb_link_crc_errors(),
           (unsigned)tb_ui_source_buttons_dropped());
    printf("\n");
    return 0;
}

/*
 * Read and decode the STM32's whole snapshot in one shot. `i2creg 0x42 0 48`
 * would show the same bytes, but reading hex and applying tb_regs.h offsets by
 * hand is exactly where mistakes happen -- and this also proves the ESP32's
 * decode path agrees with the STM32's layout, which raw hex cannot.
 *
 * Read-only, like every other I2C command here, and behind the shared bus lock
 * so it cannot land between the poll task's own pointer-write and read. 100 ms
 * rather than a block: if the bus is wedged this must SAY so, not join the queue
 * of tasks waiting on it -- use `i2cstate` when it does.
 */
static int cmd_i2clink(int argc, char **argv)
{
    i2c_master_bus_handle_t bus = bsp_i2c_get_handle();
    i2c_master_dev_handle_t dev = NULL;
    uint8_t raw[TB_REG_SNAPSHOT_END];
    uint8_t reg = TB_REG_PROTO_VER;
    vitals_t v;
    esp_err_t err;
    const i2c_device_config_t cfg = {
        .dev_addr_length = I2C_ADDR_BIT_LEN_7,
        .device_address = TB_I2C_SLAVE_ADDR,
        .scl_speed_hz = 100000,
    };

    (void)argc;
    (void)argv;

    if (bus == NULL) {
        printf("i2c bus not up\n");
        return 1;
    }
    /* Own handle rather than reusing the poll task's: this must work even if
     * tb_link_start() failed, which is precisely when it is most useful. */
    err = i2c_master_bus_add_device(bus, &cfg, &dev);
    if (err != ESP_OK) {
        printf("add_device failed: %s\n", esp_err_to_name(err));
        return 1;
    }
    if (!bsp_i2c_lock(100)) {
        printf("i2c bus busy (lock timeout) -- try `i2cstate`; if "
               "scl_rst_slv_en=1 the master is wedged\n");
        (void)i2c_master_bus_rm_device(dev);
        return 1;
    }

    err = i2c_master_transmit_receive(dev, &reg, 1, raw, TB_REG_READ_END, 200);
    if (err != ESP_OK) {
        bsp_i2c_unlock();
        printf("read failed: %s\n", esp_err_to_name(err));
        printf("  check SDA=GPIO15->PB3, SCL=GPIO7->PB10, and that the STM32\n"
               "  is running (not halted at a breakpoint).\n");
        (void)i2c_master_bus_rm_device(dev);
        return 1;
    }

    /*
     * RSSI in its own transaction, exactly as the poll task does it, and for the
     * same reason: asking for TB_REG_SNAPSHOT_END bytes in one go would make an
     * STM32 built before that register serve one byte past its buffer, turning
     * the whole command into "read failed" on the firmware that needs it most.
     * A failed second read is not fatal here -- it decodes as "no reading".
     */
    {
        uint8_t rssi_reg = TB_REG_LORA_RSSI;

        if (i2c_master_transmit_receive(dev, &rssi_reg, 1,
                                        &raw[TB_REG_LORA_RSSI], 1, 200)
            != ESP_OK) {
            raw[TB_REG_LORA_RSSI] = 0xFFU;
        }
    }
    /* Both transactions done; the printing below touches no bus. */
    bsp_i2c_unlock();

    printf("proto_ver : 0x%02x %s\n", raw[TB_REG_PROTO_VER],
           (raw[TB_REG_PROTO_VER] == TB_PROTO_VER) ? "(ok)"
                                                   : "(MISMATCH -- tb_regs.h "
                                                     "differs from the STM32)");
    printf("seq       : %u   (must change between calls, or the superloop is stuck)\n",
           raw[TB_REG_SEQ]);
    printf("flags     : 0x%02x  hr=%d spo2=%d rr=%d bp=%d measuring=%d\n",
           raw[TB_REG_FLAGS],
           (raw[TB_REG_FLAGS] & TB_FLAG_HR_VALID) ? 1 : 0,
           (raw[TB_REG_FLAGS] & TB_FLAG_SPO2_VALID) ? 1 : 0,
           (raw[TB_REG_FLAGS] & TB_FLAG_RR_VALID) ? 1 : 0,
           (raw[TB_REG_FLAGS] & TB_FLAG_BP_VALID) ? 1 : 0,
           (raw[TB_REG_FLAGS] & TB_FLAG_MEASURING) ? 1 : 0);
    /* The two label bits, on their own line because they answer different
     * questions from the validity bits above: ppg_contact says the waveform at
     * TB_REG_PPG_BASE is trustworthy, and hr_from_ppg says the rate in
     * TB_REG_HR came from the MAX30102 rather than the ECG. A blank HR tile
     * with hr=0 and hr_from_ppg=0 means neither sensor produced a rate, which
     * is a STM32-side diagnosis, not an ESP32 one. */
    printf("          : ppg_contact=%d hr_from_ppg=%d%s\n",
           (raw[TB_REG_FLAGS] & TB_FLAG_PPG_CONTACT) ? 1 : 0,
           (raw[TB_REG_FLAGS] & TB_FLAG_HR_FROM_PPG) ? 1 : 0,
           (raw[TB_REG_FLAGS] & TB_FLAG_HR_FROM_PPG) ? "  (label it PR, not HR)"
                                                     : "");
    printf("buttons   : 0x%02x  [%c%c%c%c]  (1=pressed, left to right)\n",
           raw[TB_REG_BUTTONS],
           (raw[TB_REG_BUTTONS] & TB_BTN_1) ? '1' : '.',
           (raw[TB_REG_BUTTONS] & TB_BTN_2) ? '2' : '.',
           (raw[TB_REG_BUTTONS] & TB_BTN_3) ? '3' : '.',
           (raw[TB_REG_BUTTONS] & TB_BTN_4) ? '4' : '.');
    printf("sensor_ok : 0x%02x  ecg=%d max30102=%d mic=%d rfid=%d lora=%d\n",
           raw[TB_REG_SENSOR_OK],
           (raw[TB_REG_SENSOR_OK] & TB_SENSOR_ECG) ? 1 : 0,
           (raw[TB_REG_SENSOR_OK] & TB_SENSOR_MAX30102) ? 1 : 0,
           (raw[TB_REG_SENSOR_OK] & TB_SENSOR_MIC) ? 1 : 0,
           (raw[TB_REG_SENSOR_OK] & TB_SENSOR_RFID) ? 1 : 0,
           (raw[TB_REG_SENSOR_OK] & TB_SENSOR_LORA) ? 1 : 0);
    printf("battery   : %u%s\n", raw[TB_REG_BATTERY],
           (raw[TB_REG_BATTERY] == 0xFFU) ? " (not measured)" : "%");

