yukebrillianth/triagebox_esp32_node/components/triagebox_debug/tb_debug.c
    /*
     * Downlink RSSI, one byte past the vitals block. Printing the raw byte
     * alongside the reading is deliberate: 0x00 (no poll heard yet) and 0xFF (an
     * STM32 built before this register existed, answering with its pad) are the
     * two states someone debugging a silent radio actually needs to tell apart,
     * and both render as "--" on the screen.
     */
    {
        int8_t rssi = (int8_t)raw[TB_REG_LORA_RSSI];

        if (tb_rssi_valid(rssi)) {
            printf("lora_rssi : %d dBm  (station -> this node, last poll)\n",
                   (int)rssi);
        } else {
            printf("lora_rssi : -- (raw 0x%02x: %s)\n",
                   (unsigned)raw[TB_REG_LORA_RSSI],
                   (raw[TB_REG_LORA_RSSI] == 0x00U)
                       ? "no poll heard yet -- polls are 15s apart"
                       : "STM32 predates this register, or refused the address");
        }
    }

    if (tb_i2c_decode_vitals(raw, &v)) {
        printf("decoded   : hr=%u spo2=%u rr=%u bp=%u/%u\n",
               v.hr, v.spo2, v.rr, v.bp_sys, v.bp_dia);
        /* valid_mask is what the screens render from; `valid` only gates the
         * model. Printing both makes "the number is there but the tile is blank"
         * a one-line diagnosis. */
        printf("shown     : hr=%d spo2=%d rr=%d bp=%d   model_valid=%d\n",
               (v.valid_mask & UI_VITAL_HR) ? 1 : 0,
               (v.valid_mask & UI_VITAL_SPO2) ? 1 : 0,
               (v.valid_mask & UI_VITAL_RR) ? 1 : 0,
               (v.valid_mask & UI_VITAL_BP) ? 1 : 0, (int)v.valid);
    } else {
        printf("decoded   : REFUSED (proto_ver mismatch)\n");
    }

    if (raw[TB_REG_RFID_LEN] > 0U) {
        uint8_t n = raw[TB_REG_RFID_LEN];
        if (n > TB_RFID_MAX) {
            n = TB_RFID_MAX;
        }
        printf("rfid      : %u bytes \"%.*s\"\n", raw[TB_REG_RFID_LEN], (int)n,
               (const char *)&raw[TB_REG_RFID]);
    } else {
        printf("rfid      : none\n");
    }

    (void)i2c_master_bus_rm_device(dev);
    return 0;
}

/*
 * The STM32F411's 96-bit factory UID, as hex. This is the whole point of
 * TB_REG_UID: the station maps UID -> node_id so one STM32 binary serves every
 * board, and adding a board to that table must be possible from this serial
 * monitor, not from a debugger on an SWD probe. Read the twelve bytes, paste
 * them into the table.
 *
 * Like `i2clink` but through tb_link_read_uid(): the poll task's own device
 * handle, under the shared bus lock, so it only works once the link is up --
 * which is exactly when there is an STM32 to read.
 *
 * Twelve 0xFF is NOT a UID: the F411's UID block never reads all-ones, so that
 * pattern is the 0xFF pad an STM32 built before the register existed answers
 * with. Said outright rather than printed, so a stale board is not mistaken for
 * a board whose UID was captured.
 */
static int cmd_uid(int argc, char **argv)
{
    uint8_t uid[TB_REG_UID_LEN];
    esp_err_t err;
    bool all_ff = true;

    (void)argc;
    (void)argv;

    err = tb_link_read_uid(uid);
    if (err == ESP_ERR_INVALID_STATE) {
        printf("link not started -- tb_link_start() has not run\n");
        return 1;
    }
    if (err == ESP_ERR_TIMEOUT) {
        printf("I2C bus busy (lock timeout) -- try `i2cstate`\n");
        return 1;
    }
    if (err != ESP_OK) {
        printf("read failed: %s -- check the STM32 link with `i2clink`\n",
               esp_err_to_name(err));
        return 1;
    }

    for (int i = 0; i < (int)TB_REG_UID_LEN; i++) {
        if (uid[i] != 0xFFU) {
            all_ff = false;
            break;
        }
    }
    if (all_ff) {
        printf("twelve 0xFF -- this STM32 predates TB_REG_UID; reflash it and "
               "retry\n");
        return 1;
    }

    printf("uid:");
    for (int i = 0; i < (int)TB_REG_UID_LEN; i++) {
        printf(" %02x", uid[i]);
    }
    printf("   (paste these into the station's UID -> node_id table)\n");
    return 0;
}

/*
 * SW6106 power telemetry: how much current the board is actually drawing.
 *
 * The registers come from "SW6106 I2C Register List RG006_1_v1.2" §2.15-2.22,
 * which DOES publish an ADC block -- the older comment in this file saying 0xb0
 * was the only named register was wrong, and `i2creg`'s help text still says so.
 * Every value below is a 12-bit ADC split across two registers, high nibble in
 * the shared byte:
 *
 *   Vbat   = ((0x15[3:0]<<8) | 0x14) * 1.2 mV
 *   Vout   = ((0x15[7:4]<<8) | 0x16) * 4   mV
 *   Ichg   = ((0x18[3:0]<<8) | 0x17) * 25/7 mA
 *   Idischg= ((0x18[7:4]<<8) | 0x19) * 25/7 mA
 *   Tdie   = (((0x1B[3:0]<<8) | 0x1A) - 1851) / 6.82  degC
 *
 * IDISCHG IS THE ANSWER TO "what is the board drawing": it is the battery-side
 * current out of the gauge, so it covers the ESP32, the LCD, the STM32 and
 * everything else downstream of the boost, measured on the one path they share.
 * Note it is battery-side, not 5V-side: at ~3.8V battery into a 5V boost, 5V
 * load current is roughly Idischg * 3.8/5 minus boost losses, so do not compare
 * it directly against a 5V rail measurement.
 *
 * Charging and discharging are mutually exclusive on this part, so exactly one
 * of the two currents is meaningful at a time -- 0x11 says which, and the
 * printout marks it rather than leaving you to guess which zero is real.
 *
 * Read-only, and no unlock: REG 0x01[7:6] and 0x22[7:6] gate WRITES to their own
 * registers only. This deliberately stays out of ui_board.c -- that file's
 * contract is "the only write in this tree is ui_board_power_off()" and its
 * selftest fake asserts on any register outside 0x49/0x4F/0x11, so putting
 * debug telemetry there would either weaken that assert or force a fake update
 * for something no production path reads.
 *
 * One transaction per register: the SW6106's pointer does not auto-increment,
 * so a burst re-reads the same byte (the same trap `i2creg` documents).
 */
#define PMIC_ADDR 0x3cU

static esp_err_t pmic_reg(i2c_master_dev_handle_t dev, uint8_t reg, uint8_t *val)
{
    /* One retry, which is right HERE and would be wrong in ui_board_battery():
     * this is an idempotent debug read the operator is waiting on, not a 10 s
     * periodic poll that can skip a turn. The lock (inside locked_reg_read) is
     * per register rather than per sample, because between registers the STM32
     * poll task must get its turn -- ten registers behind one take at 100 kHz
     * would stall the link for longer than its own poll period. */
    esp_err_t err = locked_reg_read(dev, reg, val, 1);

    if (err != ESP_OK) {
        vTaskDelay(pdMS_TO_TICKS(5));
        err = locked_reg_read(dev, reg, val, 1);
    }
    return err;
}

static int cmd_pmic(int argc, char **argv)
{
    i2c_master_bus_handle_t bus = bsp_i2c_get_handle();
    i2c_master_dev_handle_t dev = NULL;
    i2c_device_config_t cfg = {
        .dev_addr_length = I2C_ADDR_BIT_LEN_7,
        .device_address = PMIC_ADDR,
        .scl_speed_hz = 100000,
    };
    /* Sampled repeatedly because a single reading is nearly useless here: the
     * LCD backlight, LoRa TX and the boost's own ripple move this by hundreds of
     * mA, so what you want is a series to watch while you toggle a load. */
    int samples = (argc > 1) ? atoi(argv[1]) : 1;
    int period_ms = (argc > 2) ? atoi(argv[2]) : 1000;

    if (samples < 1 || samples > 600) {
        printf("usage: pmic [samples 1..600] [period_ms 100..10000]\n");
        return 1;
    }
    if (period_ms < 100 || period_ms > 10000) {
        printf("period_ms must be 100..10000\n");
        return 1;
    }
    if (bus == NULL) {
        printf("I2C bus not up -- bsp_i2c_init() has not run\n");
        return 1;
    }
    if (i2c_master_bus_add_device(bus, &cfg, &dev) != ESP_OK) {
        printf("could not add the PMIC at 0x%02x\n", (unsigned)PMIC_ADDR);
        return 1;
    }

