yukebrillianth/triagebox_esp32_node/components/triagebox_debug/tb_debug.c
    printf("  soc   Vbat    Vout    Ichg  Idischg   Tdie  state\n");
    for (int n = 0; n < samples; n++) {
        /* Order matters: the decode below indexes this array. One transaction
         * each, and the failing register is named rather than just the errno --
         * this bus is shared with the GT911, the TCA9554 and the STM32, and a
         * failure on the FIRST register (bus wedged, and `I2C hardware timeout
         * detected` in the log) is a different problem from a failure on the
         * last one (this part unhappy with one address). */
        static const uint8_t regs[] = {0x11U, 0x14U, 0x15U, 0x16U, 0x17U,
                                       0x18U, 0x19U, 0x1AU, 0x1BU, 0x4FU};
        uint8_t v[sizeof(regs)] = {0};
        esp_err_t err = ESP_OK;
        unsigned bad = 0;

        for (unsigned i = 0; i < sizeof(regs) && err == ESP_OK; i++) {
            err = pmic_reg(dev, regs[i], &v[i]);
            bad = i;
        }
        if (err != ESP_OK) {
            printf("read failed at reg 0x%02x: %s\n", (unsigned)regs[bad],
                   esp_err_to_name(err));
            (void)i2c_master_bus_rm_device(dev);
            return 1;
        }

        const uint8_t st = v[0], vb_l = v[1], vhi = v[2], vo_l = v[3];
        const uint8_t ic_l = v[4], ihi = v[5], id_l = v[6], t_l = v[7];
        const uint8_t thi = v[8], soc = v[9];

        /* Integer arithmetic throughout: *25/7 in that order keeps the ratio
         * exact to the nearest mA without dragging in floats, and the 12-bit
         * input cannot overflow int on the way (4095*25 = 102375). */
        unsigned vbat_mv = (((unsigned)(vhi & 0x0FU) << 8) | vb_l) * 12U / 10U;
        unsigned vout_mv = (((unsigned)(vhi >> 4) << 8) | vo_l) * 4U;
        unsigned ichg_ma = (((unsigned)(ihi & 0x0FU) << 8) | ic_l) * 25U / 7U;
        unsigned idis_ma = (((unsigned)(ihi >> 4) << 8) | id_l) * 25U / 7U;
        int tdie_raw = (int)(((unsigned)(thi & 0x0FU) << 8) | t_l);
        /* x100 then /682 rather than /6.82, same reason. Below the 1851 offset
         * the part is reading nonsense (or has not converted yet), and a large
         * negative temperature is a clearer signal of that than a clamp. */
        int tdie_c = (tdie_raw - 1851) * 100 / 682;

        printf("  %3u%%  %u.%03uV  %u.%03uV  %5umA  %5umA  %4dC  %s%s%s\n",
               (unsigned)(soc & 0x7FU), vbat_mv / 1000U, vbat_mv % 1000U,
               vout_mv / 1000U, vout_mv % 1000U, ichg_ma, idis_ma, tdie_c,
               (st & 0x10U) ? "chg " : "", (st & 0x20U) ? "boost " : "",
               ((st & 0x30U) == 0U) ? "idle" : "");
        if (n + 1 < samples) {
            vTaskDelay(pdMS_TO_TICKS(period_ms));
        }
    }
    printf("  Idischg is battery-side draw (ESP32 + LCD + STM32 together).\n");
    printf("  Ichg and Idischg are exclusive: read the one the state column names.\n");

    (void)i2c_master_bus_rm_device(dev);
    return 0;
}

/*
 * Arm the CSV dump in bp_capture.c. It fires once, at the end of the NEXT
 * completed measurement, after the verdict has been published -- so the
 * sequence is: `bplog`, then run a normal measurement, then let the ~6000 lines
 * finish printing before touching the box again.
 *
 * The point is the raw columns. Any candidate filter (the Butterworth cascade
 * from the other team, or whatever the training pipeline actually used) can be
 * re-run over them offline and the features and the SBP/DBP recomputed under
 * each -- which is the only way to answer "does the filter explain the bias"
 * rather than argue about topologies.
 */
static int cmd_bplog(int argc, char **argv)
{
    if (argc > 1) {
        const long secs = strtol(argv[1], NULL, 10);

        bp_capture_record((uint32_t)((secs > 0) ? secs : 0));
        printf("recording now -- no measurement needed, no BP published.\n");
        printf("  Attach the sensors and hold still; the CSV prints when the\n");
        printf("  window fills (~%lds), then ~%lds of rows at 115200.\n",
               (secs > 0) ? secs : 60L, ((secs > 0) ? secs : 60L) / 2L);
    } else {
        bp_capture_arm_dump();
        printf("armed: the next completed 60 s MEASUREMENT dumps its window.\n");
        printf("  For a bare recording with no patient: bplog <seconds>\n");
    }
    printf("  ~100 rows/s. Capture the serial log, then keep the CSV rows\n");
    printf("  (log lines interleave, so anchor on column count):\n");
    printf("    grep -E '^[0-9]+,[0-9]+,[0-9]+,-?[0-9]+,-?[0-9]' run.log > w.csv\n");
    printf("  columns: i,raw_ir,raw_red,raw_ecg,fil_ir,fil_red,fil_ecg\n");
    printf("  raw_ir/raw_red are MAX30102 counts, raw_ecg is the SIGNED ECG\n");
    printf("  word, fil_* are what this firmware's biquads fed the model.\n");
    return 0;
}

/*
 * The clock. This is the ONLY way to set it: no WiFi, no SNTP, and the RTC's
 * counters come up meaningless after the backup cell has been out. Until
 * something writes them, tb_rtc_read() refuses (Seconds[7], the oscillator-stop
 * flag) and the status bar honestly shows "--:--".
 *
 * `rtc read` prints three things that are easy to confuse and answer different
 * questions: what the chip holds, what the system clock holds, and what the
 * status bar will therefore render. A working chip with an unset system clock
 * means tb_rtc_init() ran before the cell was fitted -- reboot, do not re-set.
 */
static int cmd_rtc(int argc, char **argv)
{
    struct tm t;
    char buf[6];

    if (argc > 1 && strcmp(argv[1], "set") == 0) {
        struct tm set = {0};
        int y = 0, mo = 0, d = 0, h = 0, mi = 0;

        /* Date optional: at a demo nobody wants to type it, and the date only
         * has to be past UI_CLOCK_VALID_EPOCH for the bar to start rendering.
         * Whatever the chip already holds supplies the missing half. */
        if (argc == 4 && sscanf(argv[2], "%d-%d-%d", &y, &mo, &d) == 3 &&
            sscanf(argv[3], "%d:%d", &h, &mi) == 2) {
            set.tm_year = y - 1900;
            set.tm_mon = mo - 1;
            set.tm_mday = d;
        } else if (argc == 3 && sscanf(argv[2], "%d:%d", &h, &mi) == 2) {
            if (!tb_rtc_read(&set)) {
                printf("no date in the RTC yet -- give one: "
                       "rtc set YYYY-MM-DD HH:MM\n");
                return 1;
            }
        } else {
            printf("usage: rtc set [YYYY-MM-DD] HH:MM   (local WIB, 24-hour)\n");
            return 1;
        }
        set.tm_hour = h;
        set.tm_min = mi;
        set.tm_sec = 0;
        if (!tb_rtc_write(&set)) {
            printf("write refused or failed -- see the log line above\n");
            return 1;
        }
        /* Read it back through the same path the boot uses, so a success here
         * means the status bar really will show it. */
        tb_rtc_init();
        printf("written. ");
    } else if (argc > 1 && strcmp(argv[1], "read") != 0) {
        printf("usage: rtc read | rtc set [YYYY-MM-DD] HH:MM\n");
        return 1;
    }

