yukebrillianth/triagebox_esp32_node/components/triagebox_debug/tb_debug.c
    if (tb_rtc_read(&t)) {
        printf("chip 0x51 : %04d-%02d-%02d %02d:%02d:%02d WIB\n",
               t.tm_year + 1900, t.tm_mon + 1, t.tm_mday, t.tm_hour, t.tm_min,
               t.tm_sec);
    } else {
        printf("chip 0x51 : no time (never set, flat backup cell, or absent --\n"
               "            `i2c` should list 0x51; then `rtc set HH:MM`)\n");
    }

    time_t now = time(NULL);
    struct tm *sys = localtime(&now);

    if (sys != NULL) {
        printf("system    : %04d-%02d-%02d %02d:%02d:%02d (epoch %lld)\n",
               sys->tm_year + 1900, sys->tm_mon + 1, sys->tm_mday, sys->tm_hour,
               sys->tm_min, sys->tm_sec, (long long)now);
    }
    ui_status_format_clock(buf, sizeof(buf));
    printf("status bar: %s%s\n", buf,
           (strcmp(buf, "--:--") == 0)
               ? "   (system clock is before 2025, so the bar stays blank)"
               : "");
    return 0;
}

void tb_debug_console_start(void)
{
    esp_console_repl_t *repl = NULL;
    esp_console_repl_config_t repl_cfg = ESP_CONSOLE_REPL_CONFIG_DEFAULT();
    esp_console_dev_usb_serial_jtag_config_t dev_cfg =
        ESP_CONSOLE_DEV_USB_SERIAL_JTAG_CONFIG_DEFAULT();

    repl_cfg.prompt = "triagebox>";
    repl_cfg.max_cmdline_length = 128;
    /*
     * The default is 4096, and `stats` panicked on it every time: LoadProhibited
     * with 0xA5A5A5A5 in the argument registers and a CORRUPTED backtrace, which
     * is FreeRTOS's stack fill pattern read back as data -- a stack overflow, not
     * a wild pointer. Commands here run the GBM triage model in the console task,
     * and the measured high-water mark is 13,344 bytes, so 8192 would still have
     * crashed.
     *
     * 16 KB rather than a measured minimum because this task exists only in debug
     * builds, so the RAM is free anyway -- and `stats` prints its own high-water
     * mark, so the real requirement stays on screen instead of in a memory.
     */
    repl_cfg.task_stack_size = 16384;

    static const esp_console_cmd_t cmds[] = {
        {.command = "rfid",   .help = "Inject RFID frame [tag]",                 .func = cmd_rfid},
        {.command = "vital",  .help = "Inject VITAL [hr spo2 rr sys dia]",       .func = cmd_vital},
        {.command = "status", .help = "Inject STATUS <mask|all|none> [lora]",     .func = cmd_status},
        {.command = "btn",    .help = "Press button 0..3",                       .func = cmd_btn},
        {.command = "demo",   .help = "Demo mode for filming: demo [0|1] (toggles if omitted)", .func = cmd_demo},
        {.command = "i2c",    .help = "Scan shared I2C bus [timeout_ms]",        .func = cmd_i2c},
        {.command = "i2creg", .help = "Read regs: i2creg <addr> <reg> [count] [split]", .func = cmd_i2creg},
        {.command = "i2craw", .help = "Read with no reg pointer: i2craw <addr> [count]", .func = cmd_i2craw},
        {.command = "i2cdump", .help = "Dump reg space: i2cdump <addr> [start] [end]", .func = cmd_i2cdump},
        {.command = "i2clink", .help = "Read + decode the STM32 snapshot at 0x42", .func = cmd_i2clink},
        {.command = "i2cstate", .help = "I2C peripheral registers (works while wedged)", .func = cmd_i2cstate},
        {.command = "uid",    .help = "STM32 factory UID as hex (for the station's node_id table)", .func = cmd_uid},
        {.command = "pmic",   .help = "Power telemetry: pmic [samples] [period_ms]", .func = cmd_pmic},
        {.command = "stats",  .help = "CPU/heap/stack report",                   .func = cmd_stats},
        {.command = "rtc",    .help = "Clock: rtc read | rtc set [YYYY-MM-DD] HH:MM", .func = cmd_rtc},
        {.command = "bplog",  .help = "Arm a CSV dump of the next BP window (raw+filtered)", .func = cmd_bplog},
    };

    if (esp_console_new_repl_usb_serial_jtag(&dev_cfg, &repl_cfg, &repl) != ESP_OK) {
        ESP_LOGE(TAG, "console init failed");
        return;
    }
    for (size_t i = 0; i < sizeof(cmds) / sizeof(cmds[0]); i++) {
        ESP_ERROR_CHECK(esp_console_cmd_register(&cmds[i]));
    }
    ESP_ERROR_CHECK(esp_console_start_repl(repl));
    ESP_LOGW(TAG, "debug console ON (rfid/vital/status/btn/demo/i2c*/pmic/stats) -- disable for production");
}
